TexasInstruments/f29h85x-sdk/source/driverlib/mcan.h
//###########################################################################
//
// FILE:   mcan.h
//
// TITLE:  C29x MCAN driver
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef MCAN_H
#define MCAN_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************

#ifdef __cplusplus
extern "C" {
#endif

#include "inc/hw_mcanss.h"
#include "inc/hw_memmap.h"
#include <stdbool.h>
#include "inc/hw_types_mcan.h"

//*****************************************************************************
//
//! \addtogroup mcan_api MCAN
//! \brief This module is used for MCAN configurations.
//! @{
//
//*****************************************************************************

/* ========================================================================== */
/*                           Macros & Typedefs                                */
/* ========================================================================== */

/**
 * \brief  MCAN MSG RAM BANK number for ECC AGGR.
 */
#define MCANSS_MSG_RAM_NUM                                       (0U)

/**
 * \brief  Maximum Number of Rx Buffers.
 */
#define MCANSS_RX_BUFFER_MAX                                     (64U)

/**
 * \brief  Maximum Number of Tx Buffers.
 */
#define MCANSS_TX_BUFFER_MAX                                     (32U)

/**
 * \brief  Macro for standard Message ID filter.
 */
#define MCANSS_STD_ID_FILTER_SIZE_WORDS                          (1U)

/**
 * \brief  Macro for extended Message ID filter.
 */
#define MCANSS_EXT_ID_FILTER_SIZE_WORDS                          (2U)

/**
 * \brief  Macro for Tx Event FIFO element size.
 */
#define MCANSS_TX_EVENT_FIFO_SIZE_WORDS                          (2U)

/**
 * \brief  Macro for Interrupt Line enable mask.
 */
#define MCANSS_INTR_LINE_EN_MASK   ((MCAN_ILE_EINT0_MASK | MCAN_ILE_EINT1_MASK))


/**
 * \brief  Macro defines mask for all the interrupts status for MCAN.
 */
#define MCAN_INTR_MASK_ALL   (MCAN_IR_RF0N_MASK |                              \
                              MCAN_IR_RF0W_MASK |                              \
                              MCAN_IR_RF0F_MASK |                              \
                              MCAN_IR_RF0L_MASK |                              \
                              MCAN_IR_RF1N_MASK |                              \
                              MCAN_IR_RF1W_MASK |                              \
                              MCAN_IR_RF1F_MASK |                              \
                              MCAN_IR_RF1L_MASK |                              \
                              MCAN_IR_HPM_MASK |                               \
                              MCAN_IR_TC_MASK |                                \
                              MCAN_IR_TCF_MASK |                               \
                              MCAN_IR_TFE_MASK |                               \
                              MCAN_IR_TEFN_MASK |                              \
                              MCAN_IR_TEFW_MASK |                              \
                              MCAN_IR_TEFF_MASK |                              \
                              MCAN_IR_TEFL_MASK |                              \
                              MCAN_IR_TSW_MASK |                               \
                              MCAN_IR_MRAF_MASK |                              \
                              MCAN_IR_TOO_MASK |                               \
                              MCAN_IR_DRX_MASK |                               \
                              MCAN_IR_BEC_MASK |                               \
                              MCAN_IR_BEU_MASK |                               \
                              MCAN_IR_ELO_MASK |                               \
                              MCAN_IR_EP_MASK |                                \
                              MCAN_IR_EW_MASK |                                \
                              MCAN_IR_BO_MASK |                                \
                              MCAN_IR_WDI_MASK |                               \
                              MCAN_IR_PEA_MASK |                               \
                              MCAN_IR_PED_MASK |                               \
                              MCAN_IR_ARA_MASK)

/**
 * \brief  Maximum payload supported by CAN-FD protocol in bytes.
 */
#define MCAN_MAX_PAYLOAD_BYTES                          (64U)

//*****************************************************************************
//
// These macro definitions are used to specify Standard Filter Types to
// set the sft values of the struct MCAN_StdMsgIDFilterElement
// used as a parameter in the function MCAN_addStdMsgIDFilter()
//
//*****************************************************************************

#define MCAN_STDFILT_RANGE                             (0U)
/**< Range Filter from SFID1 to SFID2 */
#define MCAN_STDFILT_DUAL                              (1U)
/**< Dual ID Filter for SFID1 or SFID2 */
#define MCAN_STDFILT_CLASSIC                           (2U)
/**< Classic Filter: SFID1 = filter, SFID2 = mask */
#define MCAN_STDFILT_DISABLED                          (3U)
/**< Filter Element Disabled */

//*****************************************************************************
//
// These macro definitions are used to specify Standard Filter Element
// Configurations to set the sfec values of the struct MCAN_StdMsgIDFilterElement
// used as a parameter in the function MCAN_addStdMsgIDFilter()
//
//*****************************************************************************

